document.onload = parseDictionary();

function parseDictionary() {
	var jsonObj = {index: {}, glossaryOfTerms: []};

	$('table tbody tr').each(function (i) {
		var $cells = $(this).children();
		jsonObj.index[$cells.eq(0).text().replace(/(\r\n|\n|\r)/gm, "").trim().toLowerCase()] = i;
		jsonObj.glossaryOfTerms.push(new Terms($cells.eq(0).text().replace(/(\r\n|\n|\r)/gm, "").trim().toLowerCase(), new Array($cells.eq(1).text().replace(/(\r\n|\n|\r)/gm, "").trim())));

	});

	console.log(JSON.stringify(jsonObj));


	var jsonObjReady = {
		"index": {
			"інформатика": 0,
			"наука комп’ютерна": 1,
			"інформатика соціальна": 2,
			"інформатика безбумажна": 3,
			"біоінформатика": 4,
			"інфраструктура інформаційна": 5,
			"ім’я": 6,
			"істина  (в інформатиці)": 7,
			"дисципліна  (лат. disciplina –(навчання,   виховання, школа)": 8,
			"технологія інформаційна": 9,
			"система інформаційна": 10,
			"показник": 11,
			"актуалізація": 12,
			"несумісність": 13,
			"управління інформацією": 14,
			"цикл системи, життєвий": 15,
			"картина світу, наукова": 16,
			"телекомунікація": 17,
			"мережа комп’ютерна": 18,
			"мережа комп’ютерна, глобальна": 19,
			"телеконференцзв’язок": 20,
			"телеконференція": 21,
			"брандмауер": 22,
			"діяльність інформаційна": 23,
			"вибух інформаційний": 24,
			"зберігання та пошук інформації": 25,
			"послуги інформаційні": 26,
			"продукт інформаційний": 27,
			"ресурс інформаційний": 28,
			"об’єкт інформаційний": 29,
			"тип інформаційного об’єкта": 30,
			"фонд": 31,
			"картотека електронна": 32,
			"текст": 33,
			"інформатизація  (англ. informatization)": 34,
			"комп’ютеризація": 35,
			"видавництво   електронне": 36,
			"підхід": 37,
			"метод в інформатиці": 38,
			"адекватність": 39,
			"архітектура": 40,
			"діяльність наукова (науково-дослідницька)": 41,
			"новизна наукова": 42,
			"діяльність   науково-технічна (нтд)": 43,
			"діяльність   науково-технологічна": 44,
			"масштаб   наукових робіт": 45,
			"робота науково-дослідницька,  дослідно-конструкторська (нддкр)  (англ. research and development)": 46,
			"документ науковий": 47,
			"стиль науковий": 48,
			"напрямок науковий (науково-технічний)": 49,
			"тема наукова": 50,
			"база науки, дослідна": 51,
			"організація знань": 52,
			"аксіоматизація наукових знань": 53,
			"автоматизація наукових досліджень": 54,
			"ступінь автоматизації": 55,
			"концепція “семантичного павутиння”": 56,
			"консорціум 3w (w3c)": 57,
			"павутиння всесвітнє (англ.worldwideweb)": 58,
			"веб-сервер": 59,
			"броузер": 60,
			"каталог ресурсів інтернет": 61,
			"пошта електронна": 62,
			"ящик поштовий": 63,
			"повідомлення": 64,
			"підпис електронний, цифровий": 65,
			"пошта електронна багатоформатна": 66,
			"технологія інформаційна, гіпертекстова": 67,
			"гіпертекст": 68,
			"гіпермедіа": 69,
			"веб семантичний": 70,
			"веб-сервіси семантичні": 71,
			"платформа xml": 72,
			"пошук інформаційний  (англ.information retrieval)": 73,
			"система інформаційно-пошукова (іпс)": 74,
			"система пошукова, мультиагентна": 75,
			"машина пошукова": 76,
			"коефіцієнт повноти пошуку": 77,
			"коефіцієнт точності пошуку": 78,
			"коефіцієнт впевненості": 79,
			"фактор ризику": 80,
			"мова інформаційно-пошукова": 81,
			"дескриптор  (лат. descriptor — описуючий)": 82,
			"дескриптор асоціативний": 83,
			"дескриптор заголовний": 84,
			"запит пошуковий": 85,
			"слово ключове": 86,
			"підхід міждисциплінарний": 87,
			"дослідження наукові, міждисциплінарні": 88,
			"міждисциплінарність": 89,
			"підхід системний": 90,
			"аналіз системний": 91,
			"аналіз системний, структурний": 92,
			"систематизація": 93,
			"систематизація знань": 94,
			"рівень": 95,
			"групування": 96,
			"техніка структурного аналізу та  проектування": 97,
			"модель": 98,
			"модель функціональна": 99,
			"аналог": 100,
			"прототип": 101,
			"метод вагових коефіцієнтів": 102,
			"метод системної оптимізації": 103,
			"планування": 104,
			"планування ієрархічне": 105,
			"планування розподілене": 106,
			"планування стратегічне": 107,
			"планування тактичне": 108,
			"планування експерименту": 109,
			"дослідження фундаментальні": 110,
			"мета дослідження": 111,
			"етап фундаментальних і пошукових  досліджень": 112,
			"експеримент": 113,
			"масштабування": 114,
			"ідентифікація": 115,
			"“ящик сірий”": 116,
			"відкриття": 117,
			"грід   (англ. grid)": 118,
			"мережа знань, глобальна": 119,
			"пошук нисхідний": 120,
			"пошук по всьому тексту": 121,
			"пошук по дереву": 122,
			"пошук за взірцем": 123,
			"пошук по онтології": 124,
			"пошук по принципу “спочатку краще”": 125,
			"пошук переважно в глибину": 126,
			"пошук переважно в  ширину": 127,
			"пошук табличний": 128,
			"пошук асоціативний": 129,
			"поиск в глибину": 130,
			"пошук в просторі   задач": 131,
			"пошук в просторі   станів": 132,
			"пошук в ширину": 133,
			"пошук висхідний": 134,
			"пошук випадковий": 135,
			"пошук двонаправлений": 136,
			"метод пошуку по дереву": 137,
			"дерево пошуку": 138,
			"дерево нарощуване": 139,
			"інтеграція": 140,
			"уніфікація": 141,
			"методологія аналізу  та проектування складних систем у довільній предметній області (пдо)": 142,
			"проблема": 143,
			"проблема розв’язності": 144,
			"проблема   науково-прикладна": 145,
			"структура комбінована": 146,
			"задача": 147,
			"грід-обчислення": 148,
			"обчислення хмарні": 149,
			"архітектура сервісна  (сервіс-орієнтована)  (soa, англ.service-oriented  architecture)": 150,
			"іновація": 151,
			"системи підтримки іноваційної діяльності": 152,
			"впровадження": 153,
			"впроваджуваність": 154,
			"верифікація": 155,
			"задача   науково-технічна": 156,
			"задачі дослідження": 157,
			"завдання технічне (тз)": 158,
			"опис технічний": 159,
			"критерій": 160,
			"критерій оптимальності": 161,
			"стратифікація": 162,
			"оптимізація": 163,
			"результат": 164,
			"власність інтелектуальна": 165,
			"право авторське": 166,
			"пріоритет": 167,
			"конфіденційність": 168,
			"ринок науково-технічної продукції": 169,
			"сертифікація наукоємної продукції": 170,
			"стандартизація": 171,
			"стандарт": 172,
			"стандартний": 173,
			"система позначень": 174,
			"якість": 175,
			"реалізація": 176,
			"редактор онтологій": 177,
			"концептуалізація знань пдо": 178,
			"концептуалізація": 179,
			"схема концептуальна  (у штучному інтелекті)": 180,
			"модель емпірична": 181,
			"апарат логікового виведення  (в інженерії знань)": 182,
			"онтологія  (в онтологічному   інжинірингу)": 183
		},
		"glossaryOfTerms": [{
			"term": ["інформатика"],
			"definition": ["1. Наукова дисципліна, яка вивчає структуру та загальні  властивості інформації, а також закономірності всіх процесів інформаційної  взаємодії.  2. Велика область теоретичних  і прикладних знань, зв’язаних з отриманням, збереженням, перетворенням, пересилкою  та використанням інформації.  3. Наука, яка займається  вивченням законів, методів і засобів накопичення, переробки та передачі,  захисту та використання інформації у всіх сферах людської діяльності за  допомогою комп’ютерів.  4. Група дисциплін, які  займаються різними аспектами розробки та використання комп’ютерів і  комп’ютерних систем: прикладна математика, програмування, програмне  забезпечення, штучний інтелект, архітектура ЕОМ, обчислювальні мережі.  5. Наука про загальні  властивості та закономірності інформації, а також методи її пошуку, передачі,  збереження, обробки та використання в різних сферах діяльності людини.  6. Наука про доцільну обробку  інформації, яка розглядається як подання знань і повідомлень в технічних,  економічних і соціальних галузях.  7.  Наука, техніка та застосування машинної обробки, збереження та передачі  інформації; комплекс науково-практичних дисциплін, які вивчають всі аспекти  отримання, збереження та передачі інформації"]
		}, {
			"term": ["наука комп’ютерна"],
			"definition": ["Область науки і технологій, зв’язана з обробкою даних,  інформації та знань за допомогою комп’ютерів (стандарт ISO/IEC 2382-1)"]
		}, {
			"term": ["інформатика соціальна"],
			"definition": ["Інформатика,  направлена на системологічне дослідження та розвиток соціальних мереж"]
		}, {
			"term": ["інформатика безбумажна"],
			"definition": ["Технологія  збору, накопичення, переробки та обміну або розповсюдження інформації на  основі ЕОМ і машинних носіїв"]
		}, {
			"term": ["біоінформатика"],
			"definition": ["Сукупність  методів і підходів, які включають в себе:  -  математичні  методи комп’ютерного аналізу в порівняльній геноміці  (геномна біоінформатика);  -  розробка  алгоритмів і програм для передбачення просторової структури білків  (структурна біоінформатика);  -   дослідження стратегій, відповідних  обчислювальних методів, а також загальне управління інформаційною складністю  біологічних систем"]
		}, {
			"term": ["інфраструктура інформаційна"],
			"definition": ["Структура  системи інформаційного забезпечення держави, яка представляє собою сукупність  інформаційно-обчислювальних центрів, банків даних і знань. Забезпечує  загальні умови доступу всіх користувачів до інформації, яка зберігається, та  надає їм можливість використовувати нові інформаційні технології"]
		}, {
			"term": ["ім’я"],
			"definition": ["Позначення  об’єкта в програмі або системі. Може представляти собою як інформаційні  об’єкти, так і вузли, станції та процеси в мережах передачі даних та ін."]
		}, {
			"term": ["істина  (в інформатиці)"],
			"definition": ["В  різних розділах інформатики та математики – одне з двох можливих значень, які  приймають логікові змінні"]
		}, {
			"term": ["дисципліна  (лат. disciplina –(навчання,   виховання, школа)"],
			"definition": ["Будь-яка наукова чи прикладна дисципліна в інформатиці"]
		}, {
			"term": ["технологія інформаційна"],
			"definition": ["1. Практична діяльність і прикладна наука, які маніпулюють даними й інформацією  (стандарт ISO/IEC 2382-1).  2. Комплекс взаємозв’язаних  наукових, технологічних, інженерних і організаційних методів і засобів, які  забезпечують інформаційну взаємодію з людьми та технічними об’єктами для  вирішення виробничих, наукових і соціально-економічних проблем із застосуванням  комп’ютерних систем.  3. Надбання, обробка,  збереження та передача голосової, графічної, текстової та числової інформації  посередництвом заснованої на мікроелектронній комбінації комп’ютера та телекомунікаційних  зв’язків.  4. Методи, способи та прийоми застосування засобів  обчислювальної техніки при виконанні функцій збереження, обробки, передачі    та використання даних.  5. Загальний  термін, який використовується для посилань на всі технології, зв’язані із  створенням, обробкою, збереженням, використанням, пересилкою й управлінням  інформацією, в тому числі і з застосуванням обчислювальної техніки"]
		}, {
			"term": ["система інформаційна"],
			"definition": ["1. Система обробки інформації, яка працює сумісно з  організаційними ресурсами, такими як люди, технічні засоби та фінансові  ресурси (стандарт ISO/IEC 2382-1).  2. Система, яка забезпечує  введення, збереження, пошук, обробку і виведення даних за запитами чи  регулярно необхідних даних.  3.  Організовано впорядкована сукупність документів (масивів документів) та інформаційних  технологій, в тому числі з використанням засобів обчислювальної техніки та зв’язку,  які реалізують інформаційні процеси"]
		}, {
			"term": ["показник"],
			"definition": ["Складова одиниця інформації, утворена реквізитом-основою та  реквізитами-ознаками, які відносяться до нього"]
		}, {
			"term": ["актуалізація"],
			"definition": ["Процес, який  забезпечує постійне внесення поточних змін в стан системи, бази даних або  бази знань"]
		}, {
			"term": ["несумісність"],
			"definition": ["Стан в обчислювальній  системі, зворотний сумісності. Розрізняють апаратну, програмну та інформаційну  сумісність"]
		}, {
			"term": ["управління інформацією"],
			"definition": ["В системі обробки інформації – це функції управління отриманням,  аналізом, збереженням, оновленням і розподіленням інформації (стандарт  ISO/IEC 2382-1)"]
		}, {
			"term": ["цикл системи, життєвий"],
			"definition": ["Сукупність всіх фаз розвитку системи, в якій  використовуються засоби обчислювальної техніки. Термін зв’язується в  основному з інформаційними системами і став широко вживатися в  70-ірокиминулого століття. Фази життєвого циклу визначаються множиною різних  способів із різним ступенем деталізації. У більшості визначень виділяються  такі загальні фази:  1) концептуальне (ескізне)  проектування;  2) технічне завдання;  3) технічний проект;  4) робочий проект;  5) програмування;  6) тестування;  7) впровадження;  8) експлуатація та  модифікація;  9)  інші, в тому числі проектування “ручних” операцій танавчання персоналу"]
		}, {
			"term": ["картина світу, наукова"],
			"definition": ["Особлива форма  систематизації знань, якісне узагальнення та світоглядний синтез різних  наукових теорій. Являючись цілісною системою представлень про загальні  властивості та закономірності об’єктивного світу, наукова картина світу існує  як складна структура, яка включає в себе в якості складених частин  загальнонаукову картину світу та картини світу окремих наук (фізична,  біологічна, геологічна й т. ін.)"]
		}, {
			"term": ["телекомунікація"],
			"definition": ["Різновидність  зв’язку, спосіб передачі інформації за допомогою електромагнітних сигналів.  Синонім терміну “електрозв’язок”"]
		}, {
			"term": ["мережа комп’ютерна"],
			"definition": ["Наукова дисципліна, яка вивчає  організацію та процеси передачі даних між комп’ютерами. Системи, які  дозволяють комп’ютерам взаємодіяти між собою називаються комп’ютерними  мережами. В таких мережах зазвичай беруть участь два і більше вузла. Причому,  вузли можуть знаходитися на відстані сантиметрів (як в IrDA), або тисяч  кілометрів (як в Інтернеті). Область знань “Комп’ютерні мережі” часто позиціонується  як піддисципліна телекомунікацій, або як піддисципліна інформатики"]
		}, {
			"term": ["мережа комп’ютерна, глобальна"],
			"definition": ["Мережа передачі  даних, яка розрахована на обслуговування території в сотні і тисячі  кілометрів. Сукупність окремих комп’ютерів і локальних мереж, розташованих в  різних країнах, з’єднаних різними каналами зв’язку і працюючих в різних  програмних середовищах. Загальнодоступні та приватні мережі з перемиканням  пакетів, а також національні телефонні мережі слугують добрими прикладами  глобальних комп’ютерних мереж"]
		}, {
			"term": ["телеконференцзв’язок"],
			"definition": ["Заснована на використанні обчислювальної техніки система, яка дозволяє  користувачам, незважаючи на їх взаємну віддаленість у просторі і часі, брати  участь у сумісних заходах, таких як організація та управління складним  проектом"]
		}, {
			"term": ["телеконференція"],
			"definition": ["Інтегральний набір послуг обчислювальної мережі, який застосовується  з метою комунікації користувачів на основі передачі та обробки мовленнєвої,  текстової інформації та відеоінформації"]
		}, {
			"term": ["брандмауер"],
			"definition": ["Виділений комп’ютер, призначений  для підключення різних мереж до Інтернету і який забезпечує захист від  несанкціонованого доступу"]
		}, {
			"term": ["діяльність інформаційна"],
			"definition": ["Сукупність  процесів збору, перетворення, збереження, пошуку та розповсюдження  інформації, які систематично здійснюються окремою особою, групою осіб або  організацією"]
		}, {
			"term": ["вибух інформаційний"],
			"definition": ["Різке підвищення обсягу інформації,  яку повинна приймати, зберігати та використовувати людина в процесі своєї  трудової діяльності. Являється наслідком науково-технічної революції.  Спостерігається тенденція до зростання обсягу інформації, яка сприймається,  за кожен черговий проміжок часу (наприклад, за кожні 2 роки). Рахується, що  якщо минуле століття було століттям енергії, то сучасне століття – століття інформації  або знань (інформаційного або знання-орієнтованого суспільства), тобто  основна трудова діяльність людини буде пов’язана з переробкою знань"]
		}, {
			"term": ["зберігання та пошук інформації"],
			"definition": ["Дві основні операції, які виконуються над  інформацією.  1. Збереження-запис в  запам’ятовуючий пристрій для наступного використання.  2. Пошук-вилучення інформації, яка зберігається, для проведення її  обробки"]
		}, {
			"term": ["послуги інформаційні"],
			"definition": ["Послуги, які надаються інформаційними органами та обчислювальними  органами по збору, збереженню, пошуку, обробці та передачі інформації"]
		}, {
			"term": ["продукт інформаційний"],
			"definition": ["Задокументована  інформація, яка підготовлена у відповідності з потребами користувачів і  призначена або застосовна для задовольняння потреб користувачів"]
		}, {
			"term": ["ресурс інформаційний"],
			"definition": ["Окремі документи і масиви документів в інформаційних  системах (бібліотеках, архівах, фондах, банках даних та інших інформаційних  системах)"]
		}, {
			"term": ["об’єкт інформаційний"],
			"definition": ["Об’єкт  реального світу, який ідентифікується, деяке поняття чи процес, які  відносяться до предметної області, про яку зберігаються описові дані"]
		}, {
			"term": ["тип інформаційного об’єкта"],
			"definition": ["Визначення структури об’єкта, допустимих його значень і операцій, які  можна над ним виконувати"]
		}, {
			"term": ["фонд"],
			"definition": ["Систематизоване зібрання яких-небудь об’єктів: вхідних документів,  алгоритмів, програм, файлів"]
		}, {
			"term": ["картотека електронна"],
			"definition": ["Система,  призначена для збереження, каталогізації та пошуку документів із застосуванням  комп’ютера"]
		}, {
			"term": ["текст"],
			"definition": ["1. Дані у формі літералів,  символів, слів, фраз, параграфів, висловлювань, таблиць та інших літеральних  впорядкованих множин, призначених для передачі сенсу, тлумачення яких в  значній мірі засноване на знаннях читачем деякої природної мови чи штучної мови  (стандарт ISO/IEC 2382-1).  2. Інформаційний зміст документа,  програми, повідомлення"]
		}, {
			"term": ["інформатизація  (англ. informatization)"],
			"definition": ["Цілеспрямований  процес системної інтеграції комп’ютерних засобів, інформаційних і  комунікаційних технологій з метою отримання нових загальносистемних  властивостей, які дозволяють більш ефективно організувати продуктивну  діяльність людини, групи чи соціуму"]
		}, {
			"term": ["комп’ютеризація"],
			"definition": ["Автоматизація  посередництвом  комп’ютерів (стандарт ISO/IEC 2382-1)"]
		}, {
			"term": ["видавництво   електронне"],
			"definition": ["Продукування  документів друкарського рівня якості, в яких текст, графіка та рисунки  формуються за допомогою комп’ютера (стандарт ISO/IEC 2382-1)"]
		}, {
			"term": ["підхід"],
			"definition": ["Різновиди підходів в інформатиці,  за допомогою яких вирішуються складні проблеми чи завдання"]
		}, {
			"term": ["метод в інформатиці"],
			"definition": ["Сукупність  методів, які застосовуються, зазвичай, в інформаційних (в тому числі  інтелектуальних) обчислювальних системах до обробки даних і знань"]
		}, {"term": ["адекватність"], "definition": ["Відповідність, тотожність"]}, {
			"term": ["архітектура"],
			"definition": ["Концепція, яка  визначає модель, структуру, виконуючі функції та взаємозв’язок елементів  складної структури. Включає компоненти логічної, фізичної та програмної  структур"]
		}, {
			"term": ["діяльність наукова (науково-дослідницька)"],
			"definition": ["Процес,  направлений на отримання, розповсюдження та застосування нових знань"]
		}, {
			"term": ["новизна наукова"],
			"definition": ["Ознака, наявність якої дає автору  право на використання поняття “вперше” при характеристиці  отриманих їм результатів і проведеного дослідження в цілому. Частіше за все  наукова новизна зводиться до так званого елементу новизни. Елементи новизни  можуть бути присутніми як в теоретичних положеннях (закономірність, принцип,  концепція, гіпотеза і т. ін.), так і в практичних результатах (правила,  рекомендації, засоби, методи, вимоги й  т. ін.)"]
		}, {
			"term": ["діяльність   науково-технічна (нтд)"],
			"definition": ["Основа інноваційної  діяльності. Тісно зв’язана із створенням, розвитком, розповсюдженням і  застосуванням науково-технічних знань у всіх областях науки і техніки.  Поняття НТД розроблено ЮНЕСКО і являється базовою категорією міжнародних  стандартів в статистиці науки і техніки. У відповідності з рекомендаціями  ЮНЕСКО науково-технічна діяльність як об’єкт статистики охоплює три її види:   а) наукові  дослідження та розробки;  б)  науково-технічна освіта та підготовка кадрів;  в) науково-технічні  послуги. При здійсненні НТД важливе значення має поняття “масштаб наукових робіт”"]
		}, {
			"term": ["діяльність   науково-технологічна"],
			"definition": ["Отримання, розповсюдження та  застосування нових знань в області рішення технологічних, конструкторських,  економічних, організаційно-технічних і соціально-політичних проблем,  забезпечення функціонування науки, технології та виробництва як єдиної  системи"]
		}, {
			"term": ["масштаб   наукових робіт"],
			"definition": ["Спеціальний  термін в рамках категорії науково-технічної діяльності, який охоплює наступні  аспекти наукових робіт: науковий (науково-технічний) напрямок; наукова  (науково-технічна) проблема; наукова тема"]
		}, {
			"term": ["робота науково-дослідницька,  дослідно-конструкторська (нддкр)  (англ. research and development)"],
			"definition": ["Науково-дослідницька та дослідно-конструкторська робота – сукупність  робіт, направлених на отримання нових знань і практичне застосування при  створенні нового виробу чи технології.  НДДКР включає в себе:  – науково-дослідницькі роботи (НДР) – роботи пошукового,  теоретичного й експериментального характеру, які виконуються з метою  визначення технічної можливості створення нової техніки у певний термін. НДР  підрозділяються на фундаментальні (отримання нових знань) і прикладні  (застосування нових знань для вирішення конкретних задач) дослідження;  – дослідно-конструкторські  роботи та технологічні роботи – комплекс робіт по розробці конструкторської  та технологічної документації на дослідний образ виробу, виготовленню та  випробуванням дослідного взірця виробу, які виконуються по технічному  завданню"]
		}, {
			"term": ["документ науковий"],
			"definition": ["Різновидність матеріального носія  із закріпленою на ньому науковою інформацією, якій притаманна певна логічна  завершеність. Науковий документ обов’язково повинен бути співвіднесений з  місцем і часом його підготовки, а також з іменем його індивідуального чи  колективного автора. Сукупність опублікованих наукових документів складає  науково-технічну літературу, яка являється матеріальною формою існування  науки. Науковий документ – це результат завершення наукового дослідження,  засіб розповсюдження наукової інформації в просторі та часі, основний спосіб  реалізації спадковості, інтернаціонального характеру й інших закономірностей  науки, засіб затвердження пріоритету вченого, оцінки продуктивності його  праці і т. ін. Таким чином, науковий документ являється органічною  частиною соціального механізму науки"]
		}, {
			"term": ["стиль науковий"],
			"definition": ["Характеризується логічною  послідовністю викладення, впорядкованою системою зв’язку між частинами  висловлювання, прагненням авторів до точності, стислості, однозначності при  збереженні насиченості змісту"]
		}, {
			"term": ["напрямок науковий (науково-технічний)"],
			"definition": ["Найбільш велика наукова  робота, яка має самостійний характер і присвячена вирішенню важливої задачі  (проблеми) розвитку даної галузі науки і техніки. В рамках наукового напрямку  можлива взаємодія ряду наукових організацій"]
		}, {
			"term": ["тема наукова"],
			"definition": ["Частина проблеми, яка  вирішується, як правило, в межах наукової установи та виступає основною  одиницею тематичного плану за фінансування, планування та обліку робіт. Мета  теми – ефективне вирішення конкретної задачі дослідження патентних чи  економічних робіт і т. ін. Тема в залежності від своєї складності може  розбиватися на етапи та підетапи"]
		}, {
			"term": ["база науки, дослідна"],
			"definition": ["Складова частина наукового потенціалу країни, її стан і використання  характеризують здатність науки здійснювати дослідну перевірку результатів  наукових досліджень і розробок з метою забезпечення неперервності  інноваційного процесу. Дослідна база включає трудові та матеріально-технічні  ресурси, призначені для проведення дослідних і експериментальних робіт"]
		}, {
			"term": ["організація знань"],
			"definition": ["Класифікація і категоризація знань з метою їх подальшого ціле­спрямованого  вилучення"]
		}, {
			"term": ["аксіоматизація наукових знань"],
			"definition": ["Визначається  наступними структурними елементами: аксіоми або схеми аксіом (як не доказові  в даній системі положення); вихідні (початкові) поняття (такі, які явно не  визначаються в системі); правила виведення та побудови системи знань;  визначення як правила введення в теорію нових термінів, абстрактних об’єктів;  теореми як висловлювання, які виводяться; задачі, наслідки, положення, які  виводяться з теорії, леми, логіко-методологічні принципи теорії, яка аксіоматизується. Всі  вищеназвані аспекти складають базову основу формального наукового  дослідження. Поряд з ними науковий підхід необхідно допускає ще одну важливу  компоненту – інтерпретацію. Зрозуміло, що науковий сенс має лише ті абстракції,  які завідомо можуть бути прикладені до чого-небудь і які можна співставити  істині, особливо в тих випадках, коли це практично важливо і можливо.  Механізмом такого співставлення істині, пошуку логічних можливостей її  встановлення і виступає інтерпретація як логічний прийом по встановленню  значення термінологічних виразів теорій, знакової (формальної) системи.  Кожному реченню, логічно правильно побудованому, в інтерпретації надається  деяке значення, наприклад, речення може бути істинним або хибним. Питання ж  про те, яка з цих можливостей реалізована, не вирішується інтерпретацією.  Тому одна і та ж формальна система допускає множину інтерпретацій і тільки  одну істину. Інтерпретація гарантує несуперечність теорії, але не забезпечує  змістовної істинності даної теорії"]
		}, {
			"term": ["автоматизація наукових досліджень"],
			"definition": ["Використання  комп’ютера для виконання науково-дослідницьких робіт: розробки математичних  моделей, проведення досліджень з використанням моделей, обробки отриманих  даних"]
		}, {
			"term": ["ступінь автоматизації"],
			"definition": ["Характеристика технологічного процесу, яка визначається як відношення  кількості операцій, що виконуються з використанням засобів автоматизації, до  повної кількості операцій даного процесу"]
		}, {
			"term": ["концепція “семантичного павутиння”"],
			"definition": ["Направлена на інтелектуалізацію WWW і базується на  наступних основних компонентах:  -  активному використанні  метаданих на метамові XML;  -  онтологічному підході, який  дозволяє описувати терміни та відношення між ними;  -  моделі RDF, яка встановлює  спосіб представлення значень, визначених в онтології.  В Semantic Web також застосовуються:  -  універсальні ідентифікатори  ресурсів;  -  системи обробки правил  логікового виведення;  - стандартні  протоколи Інтернет"]
		}, {
			"term": ["консорціум 3w (w3c)"],
			"definition": ["Задачею консорціуму являється  створення та просування єдиних стандартів, які підвищують функціональність WWW"]
		}, {
			"term": ["павутиння всесвітнє (англ.worldwideweb)"],
			"definition": ["1. Розподілена система, яка надає доступ до зв’язаних  між собою документів, розташованих на різних комп’ютерах, підключених до  Інтернету. Всесвітнє павутиння утворюють численні веб-сервери.  2. Розподілена  інформаційна система мультимедіа, заснована на гіпертексті та побудована за  схемою “клієнт-сервер”"]
		}, {
			"term": ["веб-сервер"],
			"definition": ["Сервер, який приймає HTTP-запити  від клієнтів, зазвичай веб-броузерів, і видає їм HTTP-відповіді, як правило,  разом з HTML-сторінкою, зображенням, файлом, медіа-потоком або іншими даними.  Веб-сервером  називають як програмне забезпечення, яке виконує функції веб-сервера, так і  безпосередньо комп’ютер, на якому це програмне забезпечення функціонує.  Клієнт, яким зазвичай являється веб-броузер, передає  веб-серверу запити на отримання ресурсів, позначених URL-адресами. Ресурси –  це HTML-сторінки, зображення, файли, медіа-потоки чи інші дані, які необхідні  клієнту. У відповідь веб-сервер передає клієнту дані згідно запиту. Цей обмін  виконується за протоколом HTTP"]
		}, {
			"term": ["броузер"],
			"definition": ["Засіб огляду чи навігації під  час взаємодії з додатком (стандарт ISO/IEC 2382-1)"]
		}, {
			"term": ["каталог ресурсів інтернет"],
			"definition": ["Постійно  поновлювана та така, що доповнюється, система посилань на ресурси,  розподілені за ієрархічною структурою категорій. На верхньому рівні каталогу  представлені самі загальні категорії (рубрики), на рівнях, що лежать нижче, –  їх декомпозиція на підлеглі рубрики, які мають більш частковий характер"]
		}, {
			"term": ["пошта електронна"],
			"definition": ["1. Переписка у  вигляді повідомлень, які передаються між користувацькими терміналами по  комп’ютерній мережі (стандарт ISO/IEC 2382-1).  2.  Система пересилки повідомлень між користувачами обчислювальних систем, в якій  комп’ютер бере на себе всі функції по збереженню та пересилці повідомлень.  3. Технологія та послуги, які нею  надаються, по пересилці й отриманні електронних повідомлень (названих “листи”  або “електронні листи”) по розподіленій (в т. ч. глобальній) комп’ютерній мережі"]
		}, {
			"term": ["ящик поштовий"],
			"definition": ["Область пам’яті (частіше за все  захищена), призначена для збереження документів або даних, які були передані  по системі електронної пошти"]
		}, {
			"term": ["повідомлення"],
			"definition": ["Спеціальним чином відформатований документ, який передається в  системі електронної пошти"]
		}, {
			"term": ["підпис електронний, цифровий"],
			"definition": ["Реквізит електронного документа,  призначений для захисту даного електронного документа від підробки, отриманий  в результаті криптографічного перетворення інформації з використанням  закритого ключа електронного цифрового підпису та який дозволяє  ідентифікувати власника сертифікату ключа підпису, а також встановити  відсутність спотворення інформації в електронному документі"]
		}, {
			"term": ["пошта електронна багатоформатна"],
			"definition": ["Нові системи електронної  пошти, в яких застосовуються засоби складання та пересилки комбінованих  поштових відправлень, які можуть об’єднувати текст, графіку, мовлення, факс  та інші види інформації в одному повідомленні"]
		}, {
			"term": ["технологія інформаційна, гіпертекстова"],
			"definition": ["1.  Інформаційна (комп’ютерно-підтримана) технологія організації та вживання  текстових матеріалів, яка з’єднує нелінійний, асоціативно-фрагментарний і мережевий  принципи репрезентації інформаційного середовища з процедурами вільної  навігації по довільним нелінійним зв’язкам, зафіксованим в цьому середовищі.  2. Технологія представлення  й обробки семантичної інформації, заснована на використанні гіпертексту"]
		}, {
			"term": ["гіпертекст"],
			"definition": ["Довільний доступ до тексту, який  дозволяє на основі перехресних посилань і зв’язків робити переходи від тексту  на одній сторінці до блоків тексту на різних сторінках, а потім повернутися  на попереднє місце. Гіпертекст, наприклад, використовується при організації  контекстної допомоги"]
		}, {
			"term": ["гіпермедіа"],
			"definition": ["Розповсюдження концепції Гіпертекст  на тексти в різних середовищах"]
		}, {
			"term": ["веб семантичний"],
			"definition": ["Деяке розширення існуючого  синтаксичного веб, в якому інформації надається чітке визначення. При цьому  ключовими технологіями являються онтолого-орієнтовані технології"]
		}, {
			"term": ["веб-сервіси семантичні"],
			"definition": ["Веб-сервіси з семантикою,  представленою деякою мовою опису"]
		}, {
			"term": ["платформа xml"],
			"definition": ["Сукупність взаємозв’язаних й узгоджених стандартів і  специфікацій, які мають загальне функціональне призначення. XML забезпечує  відокремлення змістовних даних документа (контенту) від інформації, яка  описує його представлення на екрані. За допомогою XML задається логічна  розмітка документа у відповідності з деяким шаблоном, який називається моделлю  документа. Модель визначається за допомогою мов DTD або XMLSchema. В першому  випадку модель називають описом типу документа, у другому – схемою документа"]
		}, {
			"term": ["пошук інформаційний  (англ.information retrieval)"],
			"definition": ["1. Процес та засоби пошуку неструктурованої  документальної інформації, яка задовольняє інформаційні потреби, та наука про  цей пошук.  2. Методи та  процедури виявлення конкретної інформації в даних, які зберігаються.  3. Сукупність операцій, методів і процедур, направлених на  відбір даних, які зберігаються в інформаційній системі та відповідають заданим умовам"]
		}, {
			"term": ["система інформаційно-пошукова (іпс)"],
			"definition": ["1. Система, призначена для пошуку інформації у великих  документальних, бібліотечних та інших каталогах, інформаційних центрах і  т. ін.  2. Комплекс  програм, які засновані на базі даних і містять додаткові, як правило,  спеціалізовані засоби для збереження та вилучення інформації. ІПС  підрозділяються на три класи: документальні, фактографічні та гіпертекстові"]
		}, {
			"term": ["система пошукова, мультиагентна"],
			"definition": ["Пошукова система з повною  автоматизацією ініціалізації, закінченням і спрямованістю роботи системи в  цілому, та її окремих елементів зокрема, а також здатністю адаптуватися до інформаційного  середовища, яке змінюється"]
		}, {
			"term": ["машина пошукова"],
			"definition": ["Машина, яка дозволяє знаходити ресурси Інтернет безпосередньо за  їх текстовим змістом. Функціонування пошукової машини включає два базових  процеси: 1) індексування ресурсів Інтернет (автоматична побудова й оновлення  індексу); 2) пошук за індексом за запитами користувачів.  Головними  компонентами пошукової машини являються:  – програмний  агент, “який переміщується” по мережі й індексує ресурси (web-сторінки),  найбільш інтелектуальний із компонентів пошукової машини. Різновидностями  агентів являються “кроулери”, “роботи” і “пауки”;  – база даних  (індекс), яка містить інформацію, яка збирається агентом;  – програма пошуку, яка застосовується користувачами для пошуку  інформації в базі даних"]
		}, {
			"term": ["коефіцієнт повноти пошуку"],
			"definition": ["Один  з параметрів, які характеризують ефективність роботи інформаційно-пошукової  системи. Коефіцієнт повноти пошукуде а – число релевантних документів, виданих  системою у відповідь на інформаційний запит, а с – число релевантних  документів в інформаційному масиві системи, не виданих системою. Коефіцієнт  повноти пошуку зв’язаний з коефіцієнтом втрат інформації при пошуку Q  співвідношенням Р = 1 – Q"]
		}, {
			"term": ["коефіцієнт точності пошуку"],
			"definition": ["Один  з параметрів, які характеризують ефективність роботи інформаційно-пошукової  системи. Коефіцієнт точності пошукуде а – число релевантних документів, виданих  системою у відповідь на інформаційний запит, а b – число нерелевантних  документів, виданих при цьому системою. Коефіцієнт точності пошуку зв’язаний з  коефіцієнтом шуму S співвідношенням P = 1–S"]
		}, {
			"term": ["коефіцієнт впевненості"],
			"definition": ["Число,  яке відповідає ймовірності та характеризує міру істинності або хибності  факту. Використовується у нечіткій логіці для реалізації міркувань в  експертних системах за невизначеними знаннями"]
		}, {
			"term": ["фактор ризику"],
			"definition": ["Величина, протилежна коефіцієнту впевненості; характеризує міру  неточності факту, висновку, результату дії"]
		}, {
			"term": ["мова інформаційно-пошукова"],
			"definition": ["Штучна  формалізована мова, призначена для короткого й однозначного опису змісту  документів у вигляді пошукових образів з метою ідентифікації документів в  процесі пошуку"]
		}, {
			"term": ["дескриптор  (лат. descriptor — описуючий)"],
			"definition": ["Словникова  одиниця інформаційно-пошукової мови, яка виражена словом, словосполученням  або кодом і яка являється іменем класу умовної еквівалентності, в який  включені еквівалентні та близькі за змістом ключові слова"]
		}, {
			"term": ["дескриптор асоціативний"],
			"definition": ["Дескриптор,  зв’язаний асоціативним відношенням з іншими дескрипторами даної  інформаційно-пошукової мови"]
		}, {
			"term": ["дескриптор заголовний"],
			"definition": ["Основний  дескриптор статті тезауруса. Розміщується на початку статті та виділяється  шрифтом. Після нього слідують ключові слова й інші дескриптори"]
		}, {
			"term": ["запит пошуковий"],
			"definition": ["Вихідна інформація для здійснення пошуку за допомогою  пошукової системи. Формат пошукового запита залежить як від пристрою  пошукової системи, так і від типу інформації для пошуку. Частіше за все  пошуковий запит задається у вигляді набору слів або фрази, інколи –  використовуючи розширені можливості мови запитів пошукової системи"]
		}, {
			"term": ["слово ключове"],
			"definition": ["Слово або стійке словосполучення природної мови, яке використовується для вираження деякого аспекту  сенсового змісту документа (чи запита)"]
		}, {
			"term": ["підхід міждисциплінарний"],
			"definition": ["Синтез  результатів наукової діяльності представників різних дисциплін в процесі  комплексного вивчення конкретного об’єкта та зв’язаного з ним кола проблем.  Застосування міждисциплінарного підходу не означає обов’язкового створення  структурних одиниць для проведення досліджень, а також безпосередньої дослідницької  взаємодії на міждисциплінарній основі"]
		}, {
			"term": ["дослідження наукові, міждисциплінарні"],
			"definition": ["Форма  організації науково-дослідницької діяльності, направлена на комплексне  вивчення єдиного об’єкта представниками різних дисциплін, наукових  спеціальностей та галузей науки, об’єднаних для здійснення задач, які стоять  перед ними, в тому числі на основі створення постійних чи тимчасових  структурних одиниць (науково-дослідницьких інститутів і центрів, програм і  проектів, підрозділів і груп)"]
		}, {
			"term": ["міждисциплінарність"],
			"definition": ["Спосіб  взаємодії між двома чи декількома різними дисциплінами. Ця взаємодія може варіюватися  від простого обміну ідеями до взаємної інтеграції  цілих концепцій, методологій, процедур, епістемології, термінології, даних  організації дослідницької та освітянської діяльності в деякій вельми широкій  області"]
		}, {
			"term": ["підхід системний"],
			"definition": ["1. Метод розгляду питання, задачі, явища,  об’єкта як частини більш широкого єдиного і нероздільного цілого – системи  взаємозв’язаних складових елементів.  2. Напрямок методології аналізу, синтезу та дослідження, в основі якого  лежить розгляд складного об’єкта як цілісної множини елементів у сукупності відношень  і зв’язків між ними, тобто розгляд об’єкта як системи; крім того, системний  підхід – це деякий спосіб організації дій розробника (проектувальника), який  охоплює будь-який рід діяльності, виявляючи закономірності та взаємозв’язки з  метою їх більш ефективного використання для досягнення поставленої мети"]
		}, {
			"term": ["аналіз системний"],
			"definition": ["Аналіз об’єкта  (програми, системи, пристрою), який виконується на основі системного підходу.  Аналіз призначення системи, яку передбачається спроектувати, і визначення  множини вимог, яким вона повинна задовольняти. Аналіз, який виконується  системними засобами"]
		}, {
			"term": ["аналіз системний, структурний"],
			"definition": ["Особлива технологія системного аналізу, яка охоплює  всі його етапи, починаючи від початкового представлення проблеми і закінчуючи  її специфікацією та побудовою верхнього рівня системи програмно-апаратного  забезпечення"]
		}, {
			"term": ["систематизація"],
			"definition": ["Процес впорядкованого розподілення об’єктів, який здійснюється за подібністю  чи відмінністю притаманних їм ознак"]
		}, {
			"term": ["систематизація знань"],
			"definition": ["Класифікація та категоризація знань з метою їх послідуючого  цілеспрямованого вилучення; підтримка цілісності даних за рахунок реалізації відповідних  процесів"]
		}, {
			"term": ["рівень"],
			"definition": ["1. Ступінь  абстракції.  2. Шар ієрархічної  структури"]
		}, {
			"term": ["групування"],
			"definition": ["Вид  систематизації, який представляє собою з’єднання об’єктів, подібних по  яким-небудь ознакам,які систематизуються у відносно самостійні нові об’єкти –  групи"]
		}, {
			"term": ["техніка структурного аналізу та  проектування"],
			"definition": ["Підхід до моделювання складних задач і систем, який  включає в себе:  1) сукупність методів, які допомагають  аналітику зрозуміти складну систему;  2) графічна мова, яка полегшує  запис та інтерпретацію того, що зрозумів аналітик;  3) адміністративні директиви, які сприяють правильному проведенню  аналізу"]
		}, {
			"term": ["модель"],
			"definition": ["1.  Матеріальний об’єкт, система математичних залежностей або програма, яка  імітує структуру чи функціонування об’єкта, який  досліджується.  2. Математичне, натурне або інше представлення пристрою, системи  або процесу, яке використовується для навчання, аналізу, управління чи  планування.  3. Об’єкт (реальний,  знайомий або уявний), відмінний від вихідного, але здібний замінити його в  рамках вирішуваних задач"]
		}, {
			"term": ["модель функціональна"],
			"definition": ["Описує сукупність функцій,  які виконуються системою, характеризує морфологію системи (її побудову):  склад функціональних підсистем, їх взаємозв’язки"]
		}, {
			"term": ["аналог"],
			"definition": ["Об’єкт (система,  програма, пристрій), подібний до іншого об’єкта в якому-небудь відношенні (за  структурою, складу, принципу дії, засобам, які використовуються,  характеристиками). Не слід змішувати з прототипом чи копією"]
		}, {
			"term": ["прототип"],
			"definition": ["Предмет, на який переноситься інформація, отримана в результаті  вивчення моделі"]
		}, {
			"term": ["метод вагових коефіцієнтів"],
			"definition": ["Метод,  за якого для аналізу, вибору або оцінки кожному з множини показників  призначається певний ваговий коефіцієнт в залежності від значимості  (ваги)  показника"]
		}, {
			"term": ["метод системної оптимізації"],
			"definition": ["Метод  побудови складних, в тому числі комп’ютерних систем, в основі якого лежать:  багатокритеріальні функції цілей, конструювання та цілеспрямована зміна  області допустимих рішень, активна роль осіб, приймаючих рішення, у  формуванні цілей, оцінка проміжних і остаточних рішень"]
		}, {
			"term": ["планування"],
			"definition": ["Процес складання послідовності дій, підзадач, операцій,  підцілей, почергове виконання яких повинно привести до досягнення мети,  поставленої перед системою. В інтелектуальних системах планування може  здійснюватися або в просторі задач, або в просторі станів"]
		}, {
			"term": ["планування ієрархічне"],
			"definition": ["Планування, за якого спочатку відшукується приблизний план, за  допомогою якого знаходиться принципова відповідь про досягнення поставлених  цілей. Потім цей план поступово уточнюється і доводиться до рівня, коли він  може однозначно реалізуватися"]
		}, {
			"term": ["планування розподілене"],
			"definition": ["Планування, за якого окремі частини плану формуються в різних  місцях і різними засобами, а потім об’єднуються центральним органом.  Розподілене планування зустрічається в інтелектуальних роботах та інших  інтелектуальних системах, коли вони включені в систему збору, передачі й  обробки даних"]
		}, {
			"term": ["планування стратегічне"],
			"definition": ["Побудова початкового плану дій в ієрархічних системах  планування. Стратегічний план враховує тільки основні відомості про  середовище планування, але не враховує особливості конкретної ситуації, в  якій здійснюється планування. Використовується потім на нижче розташованих  рівнях"]
		}, {
			"term": ["планування тактичне"],
			"definition": ["Побудова плану дій в ієрархічних системах планування. За  тактичного планування в план, який отримується на рівні стратегічного планування,  вносяться корективи, зв’язані з врахуванням конкретних особливостей поточної  ситуації та стану плануючої системи. Рівнів тактичного планування може бути  декілька"]
		}, {
			"term": ["планування експерименту"],
			"definition": ["Система комбінування впливів на досліджувані об’єкти та процедур  оцінювання результатів цих впливів статистичними методами"]
		}, {
			"term": ["дослідження фундаментальні"],
			"definition": ["Перший етап процесу створення й освоєння нової техніки (технологій),  направлених на отримання нових наукових знань і виявлення найбільш суттєвих  закономірностей. Мета фундаментальних досліджень – розкрити нові зв’язки між  явищами, пізнати закономірності розвитку природи та суспільства безвідносно  до їх конкретного використання. Фундаментальні дослідження діляться на теоретичні  та цілеспрямовані (пошукові)"]
		}, {
			"term": ["мета дослідження"],
			"definition": ["Обґрунтоване  представлення про загальні кінцеві чи проміжні результати наукового пошуку.  По суті, згідно мети формулюється загальний задум дослідження. Тому вона  повинна бути сформульована коротко, лаконічно та гранично точно у  сенсовомувідношенні"]
		}, {
			"term": ["етап фундаментальних і пошукових  досліджень"],
			"definition": ["Такий етап заключається в зародженні інноваційної ідеї та можливості  використання нових наукових результатів. Процес створення та освоєння нової  техніки починається з фундаментальних досліджень (ФД), спрямованих на  отримання нових наукових знань та виявлення найбільш суттєвих  закономірностей. Мета ФД – розкрити нові зв’язки між явищами, пізнати  закономірності розвитку природи та суспільства відносно їх конкретного  використання. ФД розділяються на теоретичні та пошукові"]
		}, {
			"term": ["експеримент"],
			"definition": ["Науково-поставлений дослід, цілеспрямоване вивчення  викликаного явища в умовах, які точно враховуються, коли є можливість  слідкувати за ходом зміни явища, активно впливати на нього за допомогою  цілого комплексу різноманітних приладів і засобів та відтворювати це явище  кожен раз, коли наявні ті ж самі умови та коли в цьому є необхідність"]
		}, {
			"term": ["масштабування"],
			"definition": ["Представлення  величин, які використовуються в обчисленнях, таким чином, щоб і вони самі, і  результати обчислень, які проводяться з ними, знаходились в діапазоні чисел,  які можуть оброблятися в рамках даного процесу або на даному обладнанні"]
		}, {
			"term": ["ідентифікація"],
			"definition": ["Процедура  встановлення властивостей, які цікавлять дослідника, в явищі чи об’єкті, що  вивчаються. Для інтелектуальних систем ідентифікація часто означає перевірку  того, що дана система дійсно вирішує ті задачі, для вирішення яких вона була  створена"]
		}, {
			"term": ["“ящик сірий”"],
			"definition": ["Об’єкт досліджень, про внутрішній устрій якого або відомо частково,  або існують деякі гіпотези. На відміну від чорного ящика, моделі сірого ящика  враховують окрім зв’язків між реакціями та зовнішніми впливами іще й ті часткові  відомості, які відомі про  його внутрішню будову"]
		}, {
			"term": ["відкриття"],
			"definition": ["Нове наукове досягнення в процесі наукового пізнання  природи та суспільства, процес отримання раніше невідомих даних або  спостереження раніше невідомого явища природи"]
		}, {
			"term": ["грід   (англ. grid)"],
			"definition": ["1. Узгоджене, відкрите й стандартизоване середовище, яке  забезпечує гнучке, безпечне, скоординоване розділення ресурсів в рамках  віртуальної організації –сукупності незалежних користувачів, установі  ресурсів, які динамічно формуються.  2.  Сукупність розподілених комп’ютерних ресурсів, які утворюють єдину віртуальну  комп’ютерну систему, доступ до якої здійснюється через локальну чи  розподілену мережу. Грід-системи дозволяють географічно розподіленим  організаціям сумісно використовувати додатки, даній обчислювальні ресурси"]
		}, {"term": ["мережа знань, глобальна"], "definition": [""]}, {
			"term": ["пошук нисхідний"],
			"definition": ["Пошук, за якого рух по структурі пошуку відбувається від  цільових вузлів до заданих вузлів. При цьому можуть використовуватися пошук в  глибину, пошук в ширину або їх комбінація. В логічних системах аналогом  низхідного пошуку являється зворотне виведення. Інша назва низхідного пошуку  – метод зворотної хвилі"]
		}, {
			"term": ["пошук по всьому тексту"],
			"definition": ["Метод пошуку інформації, який припускає збереження повного  тексту документа і зводиться до виявлення входжень заданого рядка в тексті"]
		}, {
			"term": ["пошук по дереву"],
			"definition": ["Будь-який метод пошуку фрагменту даних, структурованих як дерево"]
		}, {
			"term": ["пошук за взірцем"],
			"definition": ["Пошук фрагменту знань в базі знань на підставі заданого взірця.  Взірець може представляти собою повністю визначений фрагмент або містити  вільні змінні. Пошук за взірцем являється основною процедурою для пошуку  інформації в базах знань"]
		}, {
			"term": ["пошук по онтології"],
			"definition": ["Пошукова процедура, яка визначає алгоритм пошуку по онтології  предметної області"]
		}, {
			"term": ["пошук по принципу “спочатку краще”"],
			"definition": ["Пошук, за якого в кожному вузлі простору пошуку вибирається те  продовження, яке має кращу для даного вузла локальну оцінку успіху. Таким  чином, це одна із різновидностей пошуку в глибину"]
		}, {
			"term": ["пошук переважно в глибину"],
			"definition": ["Різновидність пошуку по орієнтованому графу, а отже, і по дереву"]
		}, {
			"term": ["пошук переважно в  ширину"],
			"definition": ["Метод пошуку по дереву, заснований на тому, що спочатку  здійснюється пошук по всім вузлам рівня к, а потім вже – по вузлам рівня к+1"]
		}, {
			"term": ["пошук табличний"],
			"definition": ["Швидкий метод перетворення однієї множини значень даних в інше, причому  вихідні дані зберігаються у вигляді таблиці"]
		}, {
			"term": ["пошук асоціативний"],
			"definition": ["Пошук за взірцем в базах знань"]
		}, {
			"term": ["поиск в глибину"],
			"definition": ["Пошук, за якого рух по структурі пошуку  відбувається вздовж одного шляху до кінця. За неуспіху відбувається перегляд  іншого шляху. Для повернення в найближчу точку розгалуження використовується  процедура бектрекінгу"]
		}, {
			"term": ["пошук в просторі   задач"],
			"definition": ["Низхідний пошук, коли структура пошуку  задається декомпози­цією крупних задач на більш мілкі аж до задач, рішення  яких системі невідомо. Задача, яка підлягає рішенню, розглядається як  цільовий вузол, і від нього йде низхідний пошук до множини задач, рішення  яких системі невідомо"]
		}, {
			"term": ["пошук в просторі   станів"],
			"definition": ["Простір  станів представляється четвіркоюз наступними позначеннями:  –множина вершин графа чи станів; –множина дуг між вершинами, які відповідають крокам в  процесі рішення задачі;  –  непуста множина початкових станів задачі;  –  непуста множина, яка складається з  цільових станів. Ці стани описуються наступним чином:  – вимірюваними властивостями станів, які  зустрічаються в процесі пошуку;  – властивостями шляхів, які виникають в  процесі пошуку.  Допустимий  шлях – це шлях із вершини множиниу  вершину із множини. Шлях являється  метою пошуку"]
		}, {
			"term": ["пошук в ширину"],
			"definition": ["1.  Спосіб обходу дерева пошуку, за якого спочатку аналізуються всі вершини  одного рівня, потім вершини наступного рівня і т. д.  2. Пошук, за якого рух по структурі пошуку  здійснюється на певну глибину за всіма напрямками, можливими з даної точки  пошуку. Якщо всі просування виявилися  неуспішними, то  або підвищується глибина пошуку, або звужується фронт пошуку і здійснюється подальше  просування по всьому цьому фронту іще на задане число кроків. Звуження фронту  призводить до того, що пошук в ширину комбінується з пошуком в глибину"]
		}, {
			"term": ["пошук висхідний"],
			"definition": ["Пошук, за якого рух по структурі пошуку йде від  початкових заданих вузлів до цільових вузлів. При цьому можуть  використовуватися пошук в глибину, пошук в ширину або їх комбінація. В  логічних системах аналогом висхідного пошуку являється пряме виведення. Інша  назва висхідного пошуку – метод прямої хвилі"]
		}, {
			"term": ["пошук випадковий"],
			"definition": ["Пошук в неструктурованому просторі. При випадковому пошуку за допомогою  деякого ймовірнісного розподілення вибираються вузли простору та  перевіряються, чи не є вони  цільовими. При досягненні першого цільового  вузла випадковий пошук завершується"]
		}, {
			"term": ["пошук двонаправлений"],
			"definition": ["В  дедуктивних моделях представлення й обробки знань – одночасний пошук в  прямому та зворотному напрямках"]
		}, {
			"term": ["метод пошуку по дереву"],
			"definition": ["Метод  пошуку даних у деревовидних структурах, який складається в послідовному  проходженні по лівій або по правій гілці в залежності від того, менше чи  більше шукане значення того значення, яке вказане в поточному вузлі дерева.  При рівності значень ознак пошук припиняється"]
		}, {
			"term": ["дерево пошуку"],
			"definition": ["Дерево, яке використовується для організації ключового  доступу. Внутрішні вершини дерева пошуку містять ключі, які вказують на те,  які ключі містяться у відповідних деревах"]
		}, {
			"term": ["дерево нарощуване"],
			"definition": ["Дерево,  в якому максимальне число вершин не визначене, і нові елементи можуть бути додані  до кінцевих вершин (листків). Використовується для організації пошуку по одній  ознаці"]
		}, {
			"term": ["інтеграція"],
			"definition": ["Об’єднання окремих частин (елементів) в єдине ціле"]
		}, {
			"term": ["уніфікація"],
			"definition": ["Приведення об’єктів до однаковості, єдиній формі чи  системі"]
		}, {
			"term": ["методологія аналізу  та проектування складних систем у довільній предметній області (пдо)"],
			"definition": ["Методологія, за якої виникло сімейство методик (і  відповідних стандартів) IDEF (Integrated DEFinition), орієнтованих на  розробку моделей ПдО й таких, що акцентують увагу на якому-небудь конкретному  аспекті проектування. Зокрема:  1) методика IDEF0 рекомендована для змістовного аналізу та  функціонального проектування складних систем управління, в тому числі й  програмного забезпечення (в останньому випадку складно визначити її переваги у  порівнянні з методологією об’єктно-орієнтованого програмування). Опис  об’єктів і процесів в методиці виконується у вигляді ієрархічної сукупності  діаграм з лаконічним описом функцій. Блоки на діаграмах виражають функції, а  тому їх назви – дієслова або віддієслівні іменники;  2) методика IDEF1х призначена для інформаційного  моделювання, заснована на концепції “сутність-зв’язок”. Зазвичай відправним  пунктом для розробки інформаційної моделі являється IDEF0-модель;  3) методика IDEF3 описує поведінкові аспекти конкретних додатків,  розглядає послідовність виконання та причинно-наслідковізв’язки між  ситуаціями та подіями для структурного представлення знань про ПдО. Якщо  IDEF0 зв’язана з функціональними аспектами та відповідає на питання “Що  робить система?”, то в IDEF3 деталізуються IDEF0-функції. Ця модель  відповідає на питання “Як система це робить?”;  4) методика IDEF5 призначена для онтологічного аналізу  ПдО, аналізу основних термінів і понять, які використовуються для опису  об’єктів і процесів, границь використання, а також взаємозв’язків між ними.  Слугує для ефективного дослідження та документування: словника термінів, які  використовуються при описі характеристик об’єктів і процесів, які мають  відношення до  ПдО, яка розглядається, точних і однозначних визначень всіх  термінів і класифікації логічних взаємозв’язків між ними.  Для  кожної з методик сімейства IDEF розроблені етапи та стадії побудови моделі  ПдО, мови та діаграми представлення результатів. Аналіз отриманих в результаті  застосування методик IDEF моделей ПдО та їх описів з точки зору формалізації  та комп’ютерної обробки показав, що, за своєю суттю, вони (функціональні моделі  й описи) представляють собою змістовне технічне завдання на проектування  онтологічної системи, яка включає онтологію об’єктів (сутностей), онтологію  процесів й онтологію задач"]
		}, {
			"term": ["проблема"],
			"definition": ["1. Складне теоретичне або практичне питання, яке потребує  вивчення, вирішення.  2. Суперечлива ситуація, яка виступає у вигляді протилежних  позицій в поясненні яких-небудь явищ, об’єктів, процесів и потребує адекватної  теорії для її вирішення"]
		}, {
			"term": ["проблема розв’язності"],
			"definition": ["Проблема визначення за скінченне число кроків, чи має рішення  дана задача"]
		}, {
			"term": ["проблема   науково-прикладна"],
			"definition": ["Теоретична або  практична задача, яка  потребує вирішення. Ця задача повинна відповідати двом  критеріям:  – об’єктивність. Виникнення  проблеми повинно бути продиктоване об’єктивними факторами;  – значимість. Проблема повинна мати теоретичне або прикладне значення  для науки"]
		}, {
			"term": ["структура комбінована"],
			"definition": ["Структура даних, отримана шляхом об’єднання декількох вихідних структур"]
		}, {
			"term": ["задача"],
			"definition": ["Частина  проблеми, яка підлягає аналізу або рішенню"]
		}, {
			"term": ["грід-обчислення"],
			"definition": ["Обчислення,  які виконуються в Грід-системах"]
		}, {
			"term": ["обчислення хмарні"],
			"definition": ["Модель забезпечення повсюдного та зручного  мережевого доступу за вимогою до загального пулу конфігуруємих обчислювальних  ресурсів (наприклад, мережам передачі даних, серверам, пристроям збереження  даних, додаткам і сервісам – як сумісно, так і окремо), які можуть бути  оперативно надані та вивільнені з мінімальними експлуатаційними витратами  і/або  зверненнями до провайдера. Споживачі хмарних обчислень можуть значно  зменшити витрати на інфраструктуру інформаційних технологій (в  короткостроковому та середньостроковому планах) і гнучко реагувати на зміни обчислювальних  потреб, використовуючи властивості обчислювальної еластичності хмарних послуг"]
		}, {
			"term": ["архітектура сервісна  (сервіс-орієнтована)  (soa, англ.service-oriented  architecture)"],
			"definition": ["Модульний підхід до розробки програмного забезпечення, заснований на використанні розподілених, слабо зв’язаних змінюваних компонентів, оснащених  стандартизованими інтерфейсами для взаємодії по стандартизованим протоколам.  Програмні  комплекси, розроблені у відповідності з сервіс-орієнтованою архітектурою,  зазвичай реалізуються як набір веб-служб, взаємодіючих за протоколом SOAP.  Інтерфейси компонентів в сервіс-орієнтованій  архітектурі інкапсулюють компоненти реалізації (комп’ютерну платформу, операційну систему, мова програмування) від решти компонентів, таким чином забезпечуючи  комбінування та багатократне використання компонентів для побудови складних  розподілених програмних комплексів, забезпечуючи незалежність від  використовуваних платформ та інструментів розробки, сприяючи масштабованості  та керованості створюваних систем"]
		}, {
			"term": ["іновація"],
			"definition": ["Вища  форма діяльності за своєю складністю та цінністю. Інновація формується в  результаті діяльності, направленої на використання знань для генерації ідей,  поліпшуючих процеси, продукти та послуги"]
		}, {
			"term": ["системи підтримки іноваційної діяльності"],
			"definition": ["Системи, які мають комплексний характер і  реалізують множину функцій управління знаннями, серед яких центральне місце  займають функції, які забезпечують методичну й інформаційну  підтримку  вирішення типових задач інноваційної діяльності. До таких задач відносяться:  – формування  науково-технічної політики організації (планування науково-дослідницьких  робіт, вибір стратегічних партнерів, моніторинг технологічних досягнень  конкурентів та ін .);  – концептуальне  проектування технічних систем (аналіз і виявлення проблем, притаманних  технічній системі, розробка принципових способів їх подолання, пошук аналогів  технічної системи, яка проектується,визначення перспективних напрямків удосконалення  існуючої технічної системи та ін.);  – пошук нових ринків  для існуючих продуктів;  – аналіз новизни  концепцій технічних рішень;  – виявлення нових  потреб, які технічно реалізуються;  – аналіз  технологічних тенденцій і ринків;  – систематизація інтелектуальної власності організації та ін."]
		}, {
			"term": ["впровадження"],
			"definition": ["Процес передачі  розробленого проекту у виробництво, навчання персоналу"]
		}, {
			"term": ["впроваджуваність"],
			"definition": ["Можливість отримання  функціонуючої у повному обсязі системи, запуску її у виробництво і навчання  обслуговуючого персоналу і користувачів"]
		}, {
			"term": ["верифікація"],
			"definition": ["Оцінка правильності  вихідних даних для продукування всіх вимог, як до майбутнього продукту, так і  до його виробництва"]
		}, {
			"term": ["задача   науково-технічна"],
			"definition": ["Задачі, які вирішуються в науці та техніці"]
		}, {
			"term": ["задачі дослідження"],
			"definition": ["Дії, які у своїй сукупності повинні  дати уявлення про те, що необхідно зробити, щоб мета була досягнута. Важливо  побудувати таку послідовність задач, яка б дозволяла визначити “маршрут”  наукового пошуку, його логіку і структуру"]
		}, {
			"term": ["завдання технічне (тз)"],
			"definition": ["Вихідний  документ на проектування технічного об’єкта (виробу). ТЗ встановлює основне  призначення об’єкта, який розробляється, його технічні характеристики,  показники якості та техніко-економічні вимоги, приписання по виконанню  необхідних стадій створення документації (конструкторської, технологічної, програмної  й т. ін.) та її склад, а також спеціальні вимоги"]
		}, {
			"term": ["опис технічний"],
			"definition": ["Специфікація виготовлення, в якій вказані параметри пристрою або інтегральної  схеми, її функції та схема розташування виводів"]
		}, {
			"term": ["критерій"],
			"definition": ["Ознака,  яка при оцінюванні функціонуючих об’єктів розглядається як найбільш суттєвий"]
		}, {
			"term": ["критерій оптимальності"],
			"definition": ["Характерний  показник вирішення задачі, за значенням якого оцінюється оптимальність  знайденого рішення, тобто максимальне задоволення поставленим вимогам. В  одній задачі може бути декілька критеріїв оптимальності"]
		}, {
			"term": ["стратифікація"],
			"definition": ["Впорядковування об’єктів системи за рівнями (стратами) з метою  створення ієрархічного опису системи"]
		}, {
			"term": ["оптимізація"],
			"definition": ["Процес  знаходження найкращого рішення задачі, коли найкраще рішення визначається за  деяким, зарані встановленим критерієм"]
		}, {
			"term": ["результат"],
			"definition": ["Сукупність даних, які отримуються по завершенні операції, програми, завдання"]
		}, {
			"term": ["власність інтелектуальна"],
			"definition": ["Інтелектуальні  цінності, ідеї, належність яких тому чи іншому автору юридично закріплена"]
		}, {
			"term": ["право авторське"],
			"definition": ["Галузь права, яка регулює відношення, які виникають у  зв’язку із створенням і використанням творів науки, літератури та мистецтва.  Розповсюджується на твори науки, літератури та мистецтва, які являються  результатом творчої діяльності, незалежно від призначення та гідності твору,  а також від способу його вираження. Авторське право не розповсюджується на  ідеї, методи, процеси, концепції, принципи та факти"]
		}, {
			"term": ["пріоритет"],
			"definition": ["Величина, яка характеризує значимість деякого процесу  (програми, яка виконується) по відношенню до інших аналогічних процесів, між  якими можлива конфліктна ситуація. Пріоритет, у загальному випадку,  встановлюється на основі апріорних даних про можливість програми"]
		}, {
			"term": ["конфіденційність"],
			"definition": ["1.  Право на захист даних, які належать окремим особам або установам.  2.  Право окремих осіб контролювати доступ інших осіб (користувачів) до  інформації"]
		}, {
			"term": ["ринок науково-технічної продукції"],
			"definition": ["Форма економічних відношень між власником інтелектуальної власності та  покупцем права власності, користування та розпорядження, в результаті яких здійснюється  еквівалентний обмін платіжноспроможного попиту покупця на споживацьку  цінність, яка включена в інноваційну продукцію"]
		}, {
			"term": ["сертифікація наукоємної продукції"],
			"definition": ["Елемент інфраструктури науково-технічної та  інноваційної діяльності,  який забезпечує надання послуг в області метрології, стандартизації та контролю  якості, хто освоює і виробляє нову конкурентоспроможну наукоємну продукцію та  високі технології"]
		}, {
			"term": ["стандартизація"],
			"definition": ["1. Прийняття міжнародного, національного чи  галузевого стандарту.  2. Прийняття організацією обов’язків по використанню певних  стандартів у всіх випадках, коли в цьому виникає необхідність"]
		}, {
			"term": ["стандарт"],
			"definition": ["Загальноприйняте визначення компонент технічних, програмних або інших  засобів, яке являється результатом міжнародної, національної чи галузевої угоди"]
		}, {
			"term": ["стандартний"],
			"definition": ["Визначення, яке відноситься до виробу та відповідає вимогам  відповідних стандартів"]
		}, {
			"term": ["система позначень"],
			"definition": ["Набір символів і  правил їх використання для  представлення даних"]
		}, {
			"term": ["якість"],
			"definition": ["1. Сукупність властивостей виробу, які обумовлюють його  придатність задовольняти певні потреби у відповідності з його призначенням.  Якість визначається показниками, такими як надійність, точність, повнота,  швидкодія і т. ін.  2.  Філософська  категорія, яка виражає сукупність суттєвих ознак, особливостей і властивостей,  які відрізняють один предмет чи явище від інших і надають йому визначеність"]
		}, {
			"term": ["реалізація"],
			"definition": ["Діяльність, зв’язана з втіленням заданого проекту у  вигляді працездатного виробу, або конкретний спосіб виконання частиною  системи її функцій"]
		}, {
			"term": ["редактор онтологій"],
			"definition": ["Інструментальний  засіб для роботи з онтологіями.  Характеризується підтримуваними формалізмами та форматами представлення,  функціональністю, архітектурою,  місцем збереження онтологій, мовою  програмного забезпечення, інтерфейсом користувача, доступністю та іншими можливостями. Найбільш  відомими являються Protégé, OntoEditor, OntoEditor+ та ін."]
		}, {
			"term": ["концептуалізація знань пдо"],
			"definition": ["Розробка  неформального опису знань про предметну область у вигляді графу, таблиці, діаграми чи тексту, який  відображає основні концепції та взаємозв’язки між поняттями предметної області"]
		}, {
			"term": ["концептуалізація"],
			"definition": ["Процес переходу від представлення предметної області на (обмеженій) природній мові до точної специфікації цього опису на деякій формальній мові, орієнтованій на комп’ютерне  представлення. Концептуалізація також трактується як результат подібного процесу, тобто опис множини понять (концептів) предметної області, знань про них і зв’язках (відношеннях) між ними"]
		}, {
			"term": ["схема концептуальна  (у штучному інтелекті)"],
			"definition": ["Схема бази знань, яка  відображає концептуальну модель"]
		}, {
			"term": ["модель емпірична"],
			"definition": ["Система операціональних визначень  сенсу базових термінів концептуальної моделі на  всій множині предметів онтологічної картини світу"]
		}, {
			"term": ["апарат логікового виведення  (в інженерії знань)"],
			"definition": ["Сукупність  методів і засобів формування логікового виведення на  основі фактів і даних, які зберігаються  в базі знань"]
		}, {
			"term": ["онтологія  (в онтологічному   інжинірингу)"],
			"definition": ["1. Експліцитна специфікація концептуалізації. Формально онтологія складається з термінів, організованих в таксономію, їх визначень й атрибутів, а також  зв’язаних з ними аксіом і правил  виведення.  2. База знань спеціального  типу, яка може “читатися” і розумітися, відчужуватися від розробника і/або фізично  розділятися користувачами.  3. Формалізоване представлення  основних понять предметної області та зв’язків між  ними.  Основні задачі, які  вирішуються за допомогою онтологій:  –   створення та використання баз  знань;  –   організація ефективного пошуку в базах  даних, інформаційних каталогах, базах знань;  –   створення систем, які реалізують механізми міркувань (експертні системи,  системи управління, інтелектуальні роботи та ін.);  –   організація пошуку за сенсом в текстовій інформації;  –   семантичний пошук в Інтернет;  –   побудова та використання баз знань для створення  інформаційних систем різного призначення;  –   забезпечення загальної термінології для множини  спеціалістів і додатків, які сумісно використовуються;  –   багатократне застосування баз знань та інформаційних  масивів, які представляють відомості про технічні системи на різних стадіях  їх життєвого циклу;  –   побудова знання-орієнтованих  інформаційних систем з онтолого-керованою архітектурою;  –   інформаційна та інструментальна підтримка міждисциплінарних та трансдисциплінарних наукових досліджень"]
		}]
	};
	var key = "брандмауер";
	var indx = jsonObjReady.index[key];
	console.log(indx);
	console.log(jsonObjReady.glossaryOfTerms[indx]);
}

//constructor for JSON function
function Terms(term, def) {
	this.term = [term];
	this.definition = def;
}
